#include "ad9361_spi.h"
#include "zynq_bram.h"
#include <string.h>
#include <unistd.h>

#include "../../../srv/log/log.h"
u32 cmdnum =0;
u32 invalidcmdnum =0;

/*
* 仿写RTOS中的void vTaskDelay( const TickType_t xTicksToDelay )
*/
void vTaskDelay( uint32_t dlyus )
{

}

/*
*********************************************************************************************************
*	函 数 名: delayMs
*	功能说明: 毫秒级延时函数
*	形    参：dlyms,需要延时的毫秒数
*	返 回 值: void
*	备注	:
*********************************************************************************************************
*/
void delayMs(u8 dlyms)
{

}

/*
*********************************************************************************************************
*	函 数 名: selectSpi
*	功能说明: 对连接ad9361的SPI进行初始化操作
*	形    参：spinum,spinum
*	返 回 值: void
*	备注	:
*********************************************************************************************************
*/
void selectSpi(u8 spinum)
{

}

/*
*********************************************************************************************************
*	函 数 名: ad9361_spi_write_byte
*	功能说明: 通过spi设置ad9361寄存器的值
*	形    参：addr,寄存器地址;data,需要设置的值
*	返 回 值: void
*	备注	:
*********************************************************************************************************
*/
void ad9361_spi_write_byte(u16 addr,u8 data)
{

}


/*
*********************************************************************************************************
*	函 数 名: ad9361_spi_read_byte
*	功能说明: 通过spi读取ad9361寄存器的值
*	形    参：addr,寄存器地址
*	返 回 值: 读取到的寄存器值
*	备注	:
*********************************************************************************************************
*/
u8 ad9361_spi_read_byte(u16 addr)
{
	return 0;
}

/*
*********************************************************************************************************
*	函 数 名: SetAd
*	功能说明: 根据配置参数配置ad9361寄存器
*	形    参：psetdat,一组配置参数的地址
*	返 回 值: void
*	备注	:
*********************************************************************************************************
*/
void SetAd(u8 *psetdat)
{

}




